Namedqianli/Parking-Lots-Management-Sysytem/下位机/STM32_RFID&OLED/USER/main.c
#include "stm32f10x.h"
//#include "oled.h"
#include "MAIN.h"
#include "mfrc522.h"
#include "usart.h"
#include "string.h"
#include "delay.h"
#include "Lcd_Driver.h"
#include "GUI.h"

unsigned char card1[5] = {0x20,0x25,0x35,0x55,0x3F};  //卡序列号
//unsigned char card1[4] = {0xF0,0x1C,0x70,0x3B};  //卡序列号
unsigned char card2[4] = {0xDE,0x8A,0xDF,0x2B};  //卡序列号
unsigned char card3[4] = {0xD2,0xB2,0x73,0x5B};
unsigned char card4[4] = {0xB7,0x29,0xDF,0x2B};


unsigned char snr, buf[16]="liu-bridge",bufr[16], TagType[2], SelectedSnr[4], DefaultKey[6] = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF};  
unsigned char Read_Data[16],PassWd[6],WriteData[16],RevBuffer[30], MLastSelectedSnr[4],NewKey[16];		         
char cardID[4];
unsigned char kahao;
void findcard();

void GPIO_ini()
{
  GPIO_InitTypeDef  GPIO_InitStructure;
  
  /* Enable the GPIO Clock */
  RCC_APB2PeriphClockCmd(MF522_RST_CLK, ENABLE);

  /* Configure the GPIO pin */
  GPIO_InitStructure.GPIO_Pin = MF522_RST_PIN;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;

  GPIO_Init(MF522_RST_PORT, &GPIO_InitStructure);
	
  /* Enable the GPIO Clock */
  RCC_APB2PeriphClockCmd(MF522_MISO_CLK, ENABLE);

  /* Configure the GPIO pin */
  GPIO_InitStructure.GPIO_Pin = MF522_MISO_PIN;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;

  GPIO_Init(MF522_MISO_PORT, &GPIO_InitStructure);
	
  /* Enable the GPIO Clock */
  RCC_APB2PeriphClockCmd(MF522_MOSI_CLK, ENABLE);

  /* Configure the GPIO pin */
  GPIO_InitStructure.GPIO_Pin = MF522_MOSI_PIN;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;

  GPIO_Init(MF522_MOSI_PORT, &GPIO_InitStructure);
	
  /* Enable the GPIO Clock */
  RCC_APB2PeriphClockCmd(MF522_SCK_CLK, ENABLE);

  /* Configure the GPIO pin */
  GPIO_InitStructure.GPIO_Pin = MF522_SCK_PIN;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;

  GPIO_Init(MF522_SCK_PORT, &GPIO_InitStructure);
	
  /* Enable the GPIO Clock */
  RCC_APB2PeriphClockCmd(MF522_NSS_CLK, ENABLE);

  /* Configure the GPIO pin */
  GPIO_InitStructure.GPIO_Pin = MF522_NSS_PIN;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;

  GPIO_Init(MF522_NSS_PORT, &GPIO_InitStructure);
	
  /* Enable the GPIO Clock */
  RCC_APB2PeriphClockCmd(LED_CLK, ENABLE);

  /* Configure the GPIO pin */
  GPIO_InitStructure.GPIO_Pin = LED_PIN;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;

  GPIO_Init(LED_PORT, &GPIO_InitStructure);
}

void InitializeSystem()
{
	LED_OFF;
	delay_10ms(10);
	PcdReset();
	PcdAntennaOff(); 
	PcdAntennaOn();  
	M500PcdConfigISOType( 'A' );
	LED_ON;
	delay_10ms(10);	
	LED_OFF;
	delay_10ms(10);
	LED_ON;
	delay_10ms(10);	
	LED_OFF;
}
typedef enum EVEN
{
	MONITIOR = 1,
	REGIST = 2
}EVEN;
int i,j;
int main(void)
{
	char* p = NULL;
	EVEN mode = MONITIOR;
	char status;
	unsigned char rfidflag;
	unsigned char discnt;
	kahao=0;
	SystemInit();
	delay_init();
	Lcd_Init();
	LCD_LED_SET;//通过IO控制背光亮		
	Lcd_Clear(GRAY0);
	Gui_DrawFont_GBK16(0,30,BLUE,GRAY0,"Entry Time");
	Gui_DrawFont_GBK16(0,70,BLUE,GRAY0, "Left TIme");
	delay_ms(1000);
	GPIO_ini();
  InitializeSystem( );
  uart_init(115200);
	//OLED_Init();
	//Draw_Logo();
//  for(i=0;i<2000;i++)
//	  for(j=0;j<2000;j++);
	//OLED_Fill(0x00);
  //OLED_ShowString1(0,0," RFID EPC SYS");
	//OLED_ShowString1(0,3," Status:  OK");
	printf("\r\n This is a RFID System \r\n");

	while(1)
	{
		// printf("STM32F103C8Z USART OK\r\n");
		status= PcdRequest(REQ_ALL,TagType);
		if(!status)
		{
			status = PcdAnticoll(SelectedSnr);
			if(!status)
			{
				status=PcdSelect(SelectedSnr);
				if(!status)
				{
					snr = 1;  //扇区号1
          status = PcdAuthState(KEYA, (snr*4+3), DefaultKey, SelectedSnr);// 校验1扇区密码，密码位于每一扇区第3块
					{
						if(!status)
						{
							delay_10ms(1);
							//status = PcdRead((snr*4+0), buf);  // 读卡，读取1扇区0块数据到buf[0]-buf[16] 
						//	buf[0]=2;buf[1]=2;buf[2]=3;buf[3]=4;buf[4]=5;buf[6]=1;;buf[7]=1;buf[8]=1;buf[9]=9;
				//			status = PcdWrite((snr*4+0), buf);  // 写卡，将buf[0]-buf[16]写入1扇区0块
							if(!status)
							{
								//读写成功，点亮LED
								LED_ON;	
								//printf("STM32F103C8Z USART OK\r\n");
								PcdAuthState(KEYA, (snr*4+3), DefaultKey, SelectedSnr);
								status = PcdRead((snr*4+0), bufr);  
								findcard();
								 //printf(" %s %s",bufr,SelectedSnr);
								if(mode == REGIST)
								{
									printf("*0%s#", SelectedSnr);
									delay_10ms(1);
									mode = MONITIOR;
								}
								else
								{
									printf("*1%s#",SelectedSnr);
									delay_10ms(1);
								}
								WaitCardOff();
							}
						}
					}
				}
			}
		}
		delay_10ms(1);
		LED_OFF; 
		if(USART_RX_STA&0x8000)				//检查是否有发送信息过来
		{
			USART_RX_STA=0;							//把接受标志位继续打开
			//对接受到的信息进行处理
			if(USART_RX_BUF[0] == '#')
			{
				printf("!");	//返回连接确认
			}
			else if(USART_RX_BUF[0] == '!')
			{
				mode = REGIST;		//注册模式
				printf("regist\n");
			}
			else if(USART_RX_BUF[0] == '1')		//进入时间
			{
				p = &USART_RX_BUF[1];
				Gui_DrawFont_GBK16(0,50,BLUE,GRAY0,p);
				
				
			}
			else if(USART_RX_BUF[0] == '2')		//离开时间
			{
				p = &USART_RX_BUF[1];
				Gui_DrawFont_GBK16(0,100,BLUE,GRAY0,p);	
			}
			else if(USART_RX_BUF[0] == '3')		//余额
			{
				p = &USART_RX_BUF[1];
				Gui_DrawFont_GBK16(0,130,BLUE,GRAY0, p);
			}
			p = NULL;
			memset(USART_RX_BUF, 0, sizeof(USART_RX_BUF));
		}
	}
}

void findcard()
{ unsigned char ii;
	for (ii=0;ii<5;ii++)	  //比较卡序列号
  { if (SelectedSnr[ii] == card1[ii])
    { kahao=0; 
			LED_OFF;
	    break;
	  }
	  else
	  { if (ii==3)
	    { kahao=1; 
	      goto A;
	      break; 
		  }
	  }
  }
  for (ii=0;ii<4;ii++)
  { if (SelectedSnr[ii] != card2[ii])
     { kahao=0; 
	     break;
	   }
	   else
	   { if (ii==3)
	     { kahao=2; 
				 goto A;
	 	     break; 
		   }
	   }
  }
	for (ii=0;ii<4;ii++)
  { if (SelectedSnr[ii] != card3[ii])
     { kahao=0; 
	     break;
	   }
	   else
	   { if (ii==3)
	     { kahao=3; 
				 goto A;
	 	     break; 
		   }
	   }
  }
	for (ii=0;ii<4;ii++)
  { if (SelectedSnr[ii] != card4[ii])
     { kahao=0; 
	     break;
	   }
	   else
	   { if (ii==3)
	     { kahao=4; 
				 goto A;
	 	     break; 
		   }
	   }
  }
	
A:if(kahao==1)
  {
   kahao=1; 
	}
	if(kahao==2)
	{
	  kahao=2;
	}
	if(kahao==3)
	{
	  kahao=3;
	}
	if(kahao==4)
	{
	  kahao=4;
	}
}
